Catalogs/КлассификаторБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КлассификаторБанков</Name>
			<Comment>АПК:58</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>Корреспондентский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеятельностьПрекращена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СВИФТБИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресМеждународный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИКРКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодЦБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторБанков/Forms/Классификатор/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("РежимОткрытияОкна") Тогда
		РежимОткрытияОкна = Параметры.РежимОткрытияОкна
	КонецЕсли;
	
	Параметры.Свойство("РежимВыбора", РежимВыбора);
	Элементы.Классификатор.РежимВыбора = РежимВыбора;
	
	ДанныеКлассификатора = Справочники.КлассификаторБанков.КлассификаторБанков(); 
	// Служебные реквизиты
	ПоляКлассификатора = "Код, Наименование, Город";
	
	Если ДанныеКлассификатора <> Неопределено Тогда
		
		Для Каждого Запись Из ДанныеКлассификатора Цикл
			НоваяСтрока              = Классификатор.Добавить(); 
			НоваяСтрока.Наименование = Запись.bankName;
			НоваяСтрока.Код          = Запись.bankBIK;
		КонецЦикла; 
		
	Иначе
		
		Мета = Метаданные.Справочники.КлассификаторБанков;
		ПредставлениеОбъектаКлассификатора = Мета.РасширенноеПредставлениеОбъекта;
		Если ПустаяСтрока(ПредставлениеОбъектаКлассификатора) Тогда
			ПредставлениеОбъектаКлассификатора = Мета.ПредставлениеОбъекта;
		КонецЕсли;
		Если ПустаяСтрока(ПредставлениеОбъектаКлассификатора) Тогда
			ПредставлениеОбъектаКлассификатора = Мета.Представление();
		КонецЕсли;
		Если Не ПустаяСтрока(ПредставлениеОбъектаКлассификатора) Тогда
			ПредставлениеОбъектаКлассификатора = " (" + ПредставлениеОбъектаКлассификатора + ")";
		КонецЕсли;
		
		ДанныеКлассификатора = СостояниеКлассификатора();
		Классификатор.Загрузить(ДанныеКлассификатора);
		
		Фильтр = Классификатор.НайтиСтроки(Новый Структура("Код", Параметры.ТекущаяСтрока.Код));
		Если Фильтр.Количество()>0 Тогда
			Элементы.Классификатор.ТекущаяСтрока = Фильтр[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификатор
//

&НаКлиенте
Процедура КлассификаторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборВСписке();
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыбореЭлементаКлассификатора(Значение);
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;    
	ОбработатьВыборВСписке();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьВыполнить()
	
	ОбработатьВыборВСписке();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//

&НаКлиенте
Процедура ОповеститьОВыбореЭлементаКлассификатора(ИдентификаторСтрокиВыбора)
	ВсеДанныеСтроки = Классификатор.НайтиПоИдентификатору(ИдентификаторСтрокиВыбора);
	Если ВсеДанныеСтроки<>Неопределено Тогда
		ДанныеСтроки = Новый Структура(ПоляКлассификатора);
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВсеДанныеСтроки);
		
		ДанныеВыбора = ДанныеВыбораЭлементаКлассификатора(ДанныеСтроки);
		Если ДанныеВыбора.ЭтоНовый Тогда
			ОповеститьОСозданииЭлементов(ДанныеВыбора.Ссылка);
		КонецЕсли;
		
		ОповеститьОВыборе(ДанныеВыбора.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеВыбораЭлементаКлассификатора(Знач ДанныеБанка)
	// Ищем только по коду, так как в классификаторе все коды заданы.
	Ссылка = Справочники.КлассификаторБанков.НайтиПоКоду(ДанныеБанка.Код);
	ЭтоНовый = Не ЗначениеЗаполнено(Ссылка);
	Если ЭтоНовый Тогда
		Страна = Справочники.КлассификаторБанков.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Страна, ДанныеБанка);
		Страна.Записать();
		Ссылка = Страна.Ссылка;
	КонецЕсли;
	
	// ЗУПК
	Возврат Новый Структура("Ссылка, ЭтоНовый, Код", Ссылка, ЭтоНовый, ДанныеБанка.Код);
	// ЗУПК
КонецФункции

&НаСервереБезКонтекста
Функция СостояниеКлассификатора()
	
	Данные = Справочники.КлассификаторБанков.ТаблицаКлассификатора();
	
	Данные.Колонки.Добавить("ИндексПиктограммы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0)));
	Данные.ЗаполнитьЗначения(8, "ИндексПиктограммы");
		
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОСозданииЭлементов(Ссылка)
	ОповеститьОЗаписиНового(Ссылка);
	Оповестить("Справочник.КлассификаторБанков.Изменение", Ссылка, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВСписке(СтандартнаяОбработка = Неопределено) 
		
	// Добавление элемента справочника и вывод результата пользователю.
	СтандартнаяОбработка = Ложь; 
	
	Если Элементы.Классификатор.ВыделенныеСтроки.Количество() = 1 Тогда
		
		ТекущиеДанные = Классификатор[Элементы.Классификатор.ВыделенныеСтроки[0]];
		
		Ссылка = НайтиСуществующийБанкПоБИК(ТекущиеДанные.Код);
		
		Если НЕ Ссылка.Пустая() Тогда
			ТекстВопроса = НСтр("ru='В справочнике ""Банки"" уже существует элемент с БИК %1! Открыть существующий?'");
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, 
				ТекущиеДанные.Код);
			
			Данные = Новый Структура("Ссылка", Ссылка);
			
			Режим = РежимДиалогаВопрос.ДаНетОтмена;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриПодборе", ЭтотОбъект, Данные);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
			
		Иначе 
			СтруктураДанных = Новый Структура("КодБанка, Наименование", ТекущиеДанные.Код, ТекущиеДанные.Наименование);
			СоздатьНовыйБанк(СтруктураДанных, Истина);
		КонецЕсли;
		
	Иначе 	
		
		ТекущаяСсылка = СохранитьВыбранныеСтроки(Элементы.Классификатор.ВыделенныеСтроки);
		
		ОповеститьОВыборе(ТекущаяСсылка);
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Банки добавлены.'"),,,
			БиблиотекаКартинок.ДиалогИнформация);
		Закрыть(); 
		
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриПодборе(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОткрытьФорму("Справочник.КлассификаторБанков.Форма.ФормаЭлемента", Новый Структура("Ключ", Параметры.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСуществующийБанкПоБИК(БИК)  

	Возврат Справочники.КлассификаторБанков.НайтиПоКоду(БИК);
	
КонецФункции

&НаКлиенте
Процедура СоздатьНовыйБанк(СтруктураДанных, ПоДаннымСервиса=Ложь)
	
	// Создание нового банка.
	ФормаНовогоЭлемента = ПолучитьФорму("Справочник.КлассификаторБанков.ФормаОбъекта", , ЭтаФорма);

	ОбъектЗаполнения = ФормаНовогоЭлемента.Объект;
	
	ОбъектЗаполнения.Код             					= СтруктураДанных.КодБанка;
	
	Если НЕ ПоДаннымСервиса Тогда	
		ОбъектЗаполнения.Наименование 					= СтрПолучитьСтроку(СтруктураДанных.Наименование, 1);
		ОбъектЗаполнения.Город		 					= СтрПолучитьСтроку(СтруктураДанных.Город, 1); 
	Иначе
		ОбъектЗаполнения.Наименование 					= СтруктураДанных.Наименование;	
	КонецЕсли;
	
	ФормаНовогоЭлемента.Открыть();
	
КонецПроцедуры

&НаСервере
Функция СохранитьВыбранныеСтроки(Знач ВыбранныеСтроки)
	
	ТекущаяСсылка = Неопределено;
	
	Для каждого НомерСтроки Из ВыбранныеСтроки Цикл
		ТекущиеДанные = Классификатор[НомерСтроки];
		
		СтрокаВБазе = НайтиСуществующийБанкПоБИК(ТекущиеДанные.Код); 
		Если ЗначениеЗаполнено(СтрокаВБазе) Тогда
			Если НомерСтроки = Элементы.СписокБанков.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
				ТекущаяСсылка = СтрокаВБазе;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока   			 = Справочники.КлассификаторБанков.СоздатьЭлемент();
		НоваяСтрока.Наименование = ТекущиеДанные.Наименование;
		НоваяСтрока.Код          = ТекущиеДанные.Код;
		
		НоваяСтрока.Записать();
		
		Если НомерСтроки = Элементы.Классификатор.ТекущаяСтрока Или ТекущаяСсылка = Неопределено Тогда
			ТекущаяСсылка = НоваяСтрока.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекущаяСсылка;

КонецФункции 

#КонецОбласти
